app/controllers/projects_controller.rb

INSERT INTO "projects" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "ahhhh"], ["description", "kkkkk"], ["created_at", "2022-11-23 00:50:17.181043"], ["updated_at", "2022-11-23 00:50:17.181043"]]
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save

UPDATE "projects" SET "description" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["description", "New description content"], ["updated_at", "2022-11-11 01:14:33.258204"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @project.update(project_params)